PORTRAIT_DICT = {

"ENTP":"春木之相，面如春初嫩绿，形貌柔和，眉目清秀，鼻梁高挺，唇形修长，色泽红润，笑时如花绽放，充满活力与吸引力。其人活力四射，创新多思，仁慈体贴，向上进取，应变自如，天生乐观，善于探索，与人和谐共处。春木之性，生发如木，春意盎然，活力无限。",

"ENFP":"春火之相，面如春火红润，形貌方圆，眉目分明，鼻梁挺直，唇色鲜艳，略显丰盈，笑容温暖，带有感染力，令人心生愉悦。其人天性乐观，热情洋溢，善于激励，乐助他人，交际广泛，常能在事业中大放异彩。春火之性，炽烈如火，生机勃勃，激情澎湃。",

"ENFJ":"春水之相，面如春水清澈，形貌和顺，眉目清秀，鼻梁端正，唇色柔和，微微上扬，笑容亲切，展现出关怀与热情。其人聪慧敏锐，心地善良，富有同情心，乐于助人，直觉敏锐，洞察力强，常能在人际交往中游刃有余。春水之性，灵动如水，生机盎然，温和流畅。",

"ESTJ":"春金之相，面如春金闪耀，形貌方正，眉目分明，鼻梁高挺，唇形端正，线条分明，色泽健康，给人以可靠与坚毅的感觉。其人外向活跃，善于组织，重视规则与秩序，决断果断，常能在管理和规划中表现卓越。春金之性，坚定如金，清新如春，坚韧而不失温和。",

"ENTJ":"夏木之相，面如夏木青翠，形貌高挑，眉目秀朗，鼻梁直挺，唇形分明，稍显薄锐，充满决断力与自信。其人果敢自信，充满活力，善于谋划，志向高远。性情外向，勇于冒险，领导力强，追求效率与成就。夏木之性，挺拔如木，蓬勃如夏，坚毅而充满活力。",

"ESFP":"夏火之相，面如烈火映日，形貌方正，眉目锐利，鼻梁高挺，唇色鲜明，略显丰润，笑容灿烂，充满感染力与魅力。其人热情奔放，活力四射，性情刚毅，果断坚决。性格外向，勇于开拓，善于激励他人，追求卓越与成就。夏火之性，炽烈如火，蓬勃如夏，激情洋溢。",

"ESFJ":"夏水之相，面如夏湖清波，形貌圆润，眉目清秀，鼻梁端正，唇形柔软，色泽明快，笑容开朗，充满灵动。其人温润如水，活泼机智，性情柔和，善于沟通。性格外向，灵活多变，富有适应力，重视人际关系，乐于助人。夏水之性，灵活如水，清爽如夏，善于适应变化。",

"ESTP":"夏金之相，面如烈日金辉，形貌端正，眉目清晰，鼻梁高挺，唇形坚挺，色泽略深，显示其果断。其人果敢决断，心志刚毅，性情外向，重视规则与秩序，追求效率与成就。夏金之性，坚硬如金，炽热如夏，刚毅而不失理性，强悍而不乏灵活。",

"INFJ":"秋木之相，面如秋林之肃，形貌清瘦，眉目清秀，鼻梁挺直，唇色淡雅，形状优美，笑时微微上翘，显露出深思与温柔。其人深思敏慧，心志高远，性情内敛，重视理想与原则，追求内心之和谐与宁静。秋木之性，坚韧如木，沉稳如秋，柔中有刚，静中有动。",

"INTJ":"秋火之相，面如秋阳炽烈，形貌方正，眉目分明，鼻梁高挺，唇形修长，略显薄冷，色泽淡雅，展现出理智与果断。其人心志坚毅，性情内敛，思维深邃，重视目标与策略，追求卓越与成就。秋火之性，炽热如秋阳，光辉内敛，温暖而不炽，刚毅而不失理性。",

"INFP":"秋水之相，面如秋水澄澈，形貌清秀，眉目温润，鼻梁秀挺，唇色柔和，微微丰润，笑容温婉，流露出细腻与善解人意。其人聪慧敏感，心思细腻，性情内敛，重视情感与内心世界，追求深刻的理解与共鸣。秋水之性，沉静如秋水，心志如止水，流动而不躁，柔和而不弱。",

"ISTJ":"秋金之相，面如秋月皎洁，形貌端正，眉目清晰，鼻梁高挺，唇形端庄，线条分明，色泽自然，显示出务实与可靠。其人性情稳重，思维缜密，重视秩序与规则，追求公正与效率。秋金之性，坚韧如金，沉静如秋，冷静而不失温厚，理性而不乏洞察。",

"INTP":"冬木之相，面如寒松挺拔，形貌清瘦，眉目俊秀，鼻梁修长，唇形纤薄，色泽淡雅，笑容含蓄，展现出冷静与智慧。其人思维深远，性情内敛，重视知识与智慧，追求真理与内心之安宁。冬木之性，坚韧如松，沉静如冬，内刚外柔，静中有动。",

"ISFJ":"冬火之相，面如寒夜之火，形貌方正，眉目分明，鼻梁高挺，唇形清晰，色泽适中，笑容微冷，透露出坚定与远见。其人心志坚毅，性情沉稳，重视目标与策略，追求卓越与成就。冬火之性，炽烈如火，沉静如冬，刚毅而不失温暖，理性而不乏激情。",

"ISFP":"冬水之相，面如寒潭清澈，形貌秀美，眉目温润，鼻梁修长，唇色清润，形状柔美，笑容温暖，展现出艺术气质与感性。其人心思细腻，性情内敛，重视感性与内心世界，追求和平与宁静。冬水之性，柔和如水，沉静如冬，灵活而不失稳定，敏感而不乏坚韧。",

"ISTP":"冬金之相，面如寒玉清辉，形貌端正，眉目分明，鼻梁高挺，唇形紧致，色泽略深，显示出理性与独立，言辞简洁有力。其人性情冷静，思维严谨，重视秩序与规则，追求理性与效率。冬金之性，坚毅如金，沉静如冬，理性而不失温厚，独立而不乏洞察。"

}

MBTI_TO_FACE_DICT = {
"ENTP":"春木之相",
"ENFP":"春火之相",
"ENFJ":"春水之相",
"ESTJ":"春金之相",
"ENTJ":"夏木之相",
"ESFP":"夏火之相",
"ESFJ":"夏水之相",
"ESTP":"夏金之相",
"INFJ":"秋木之相",
"INTJ":"秋火之相",
"INFP":"秋水之相",
"ISTJ":"秋金之相",
"INTP":"冬木之相",
"ISFJ":"冬火之相",
"ISFP":"冬水之相",
"ISTP":"冬金之相"
}

PREDICTION_DICT = """


轻度不佳
“根据科学算命公司的测算，未来一段时间，你可能会经历一些小挫折。虽如冬水般灵动，但在日常生活中或因情绪波动较大，偶尔感到心情低落。工作中亦或因注意力不集中，导致小失误，需谨慎行事。”

中度不佳
“据科学算命公司之测算，未来一段时间，你恐多有挑战。虽如冬水般内心丰富，但在家庭事务上或因情感表达不畅，导致与家人产生误解和矛盾，关系紧张。社交活动中亦或因过于敏感，容易感到被忽视，内心压力增大。”

严重不佳
“依科学算命公司之测算，未来一段时间，你恐遭遇严峻困境。虽如冬水般柔和灵动，但在事业上或因缺乏决断力，陷入困境，难以进展，甚至面临失败之虞。日常生活亦或因情绪起伏不定，产生严重的情感困扰和孤独感，感到无助，内心焦虑不安。”


您的面相分析：春木相----春木之相，面如春初嫩绿，形貌柔和，眉目清秀，鼻梁高挺，唇形修长，色泽红润，笑时如花绽放，充满活力与吸引力。其人活力四射，创新多思，仁慈体贴，向上进取，应变自如，天生乐观，善于探索，与人和谐共处。春木之性，生发如木，春意盎然，活力无限。

-------------------------------

您的未来运势：轻度不佳----根据科学算命公司的测算，未来一段时间，你可能会经历一些小挫折。虽如冬金般坚韧，但在财务管理上或因细节忽略，出现小额损失。家庭事务中亦或因过于严格，导致与家人产生小摩擦，偶有不和。
-------------------------------


上面空1行 中间空1行 下面空3行 31个-


"""